const FadedNews = () =>{

    return (
        <>
            <div className="fadedNews mb-3">
                <p>لا يتوقع شرقاوي أن ينجح مشروع القانون المقدم في الكونغرس في تصنيف الجماعة إرهابية، لكنه “سيمثل أداة ضغط على الإدارة الأميركية لتغير سياستها في التعاطي مع التنظيم”، فضلا عن كونه “خطوة في طريق حظره”.
                </p>
                <p>
                وأكد شرقاوي أن “الضغوط المستمرة من جانب النواب في الكونغرس على إدارة بايدن ستجعلها تغير سياستها تجاه الإخوان، أو تجعلها محايدة”.
                </p>
                <p>
                وكان كروز انتقد الطريقة التي تتعامل بها إدارة بايدن مع تنظيم الإخوان، قائلا إن “من حق الشعب الأميركي معرفة ما إذا كانت الإدارة تحاول الضغط على حلفاء الولايات المتحدة للإفراج عن المتطرفين من الإخوان”.
                </p>
                <p>
                وقال كروز إنه “في عهد الرئيس (الأسبق) باراك أوباما ونائب الرئيس بايدن، كانت السياسات المطبقة كارثة لحلفائنا في الشرق الأوسط، ونعمة لأعدائنا. مرة أخرى، تعمل إدارة بايدن على تعزيز جماعة الإخوان والجماعات المتطرفة الأخرى في الشرق الأوسط”
                </p>
                <p>
                لا يتوقع شرقاوي أن ينجح مشروع القانون المقدم في الكونغرس في تصنيف الجماعة إرهابية، لكنه “سيمثل أداة ضغط على الإدارة الأميركية لتغير سياستها في التعاطي مع التنظيم”، فضلا عن كونه “خطوة في طريق حظره”.
                </p>
                <p>
                وأكد شرقاوي أن “الضغوط المستمرة من جانب النواب في الكونغرس على إدارة بايدن ستجعلها تغير سياستها تجاه الإخوان، أو تجعلها محايدة”.
                لا يتوقع شرقاوي أن ينجح مشروع القانون المقدم في الكونغرس في تصنيف الجماعة إرهابية، لكنه “سيمثل أداة ضغط على الإدارة الأميركية لتغير سياستها في التعاطي مع التنظيم”، فضلا عن كونه “خطوة في طريق حظره”.
                </p>
                <p>
                وأكد شرقاوي أن “الضغوط المستمرة من جانب النواب في الكونغرس على إدارة بايدن ستجعلها تغير سياستها تجاه الإخوان، أو تجعلها محايدة”.
                </p>
                <p>
                وكان كروز انتقد الطريقة التي تتعامل بها إدارة بايدن مع تنظيم الإخوان، قائلا إن “من حق الشعب الأميركي معرفة ما إذا كانت الإدارة تحاول الضغط على حلفاء الولايات المتحدة للإفراج عن المتطرفين من الإخوان”.
                </p>
                <p>
                وقال كروز إنه “في عهد الرئيس (الأسبق) باراك أوباما ونائب الرئيس بايدن، كانت السياسات المطبقة كارثة لحلفائنا في الشرق الأوسط، ونعمة لأعدائنا. مرة أخرى، تعمل إدارة بايدن على تعزيز جماعة الإخوان والجماعات المتطرفة الأخرى في الشرق الأوسط”
                </p>
                <p>
                لا يتوقع شرقاوي أن ينجح مشروع القانون المقدم في الكونغرس في تصنيف الجماعة إرهابية، لكنه “سيمثل أداة ضغط على الإدارة الأميركية لتغير سياستها في التعاطي مع التنظيم”، فضلا عن كونه “خطوة في طريق حظره”.
                </p>
                <p>
                وأكد شرقاوي أن “الضغوط المستمرة من جانب النواب في الكونغرس على إدارة بايدن ستجعلها تغير سياستها تجاه الإخوان، أو تجعلها محايدة”.
                </p>
                <p>
                وكان كروز انتقد الطريقة التي تتعامل بها إدارة بايدن مع تنظيم الإخوان، قائلا إن “من حق الشعب الأميركي معرفة ما إذا كانت الإدارة تحاول الضغط على حلفاء الولايات المتحدة للإفراج عن المتطرفين من الإخوان”.
                </p>
                <p>
                وقال كروز إنه “في عهد الرئيس (الأسبق) باراك أوباما ونائب الرئيس بايدن، كانت السياسات المطبقة كارثة لحلفائنا في الشرق الأوسط، ونعمة لأعدائنا. مرة أخرى، تعمل إدارة بايدن على تعزيز جماعة الإخوان والجماعات المتطرفة الأخرى في الشرق الأوسط”..
                وكان كروز انتقد الطريقة التي تتعامل بها إدارة بايدن مع تنظيم الإخوان، قائلا إن “من حق الشعب الأميركي معرفة ما إذا كانت الإدارة تحاول الضغط على حلفاء الولايات المتحدة للإفراج عن المتطرفين من الإخوان”.
                </p>
                <p>
                وقال كروز إنه “في عهد الرئيس (الأسبق) باراك أوباما ونائب الرئيس بايدن، كانت السياسات المطبقة كارثة لحلفائنا في الشرق الأوسط، ونعمة لأعدائنا. مرة أخرى، تعمل إدارة بايدن على تعزيز جماعة الإخوان والجماعات المتطرفة الأخرى في الشرق الأوسط”..</p>
            </div>
        </>
    )
}

export default FadedNews