import newslistimg from "../../../styles/images/biden2.jpg";
const SearchResultList = () => {

    return (
        <>
            <div className="searchResultList">
                <div className="NewsList mb-4">
                    <ul>
                        <li>
                        <div className="newsImage">
                                <img className="img-fluid" src={newslistimg.src} />
                            </div>
                            <div className="newsText">
                                <p><a>أمريكا</a> منذ 5 دقائق</p>
                                <h6><a> بايدن: سيفقد حوالى 10 ملايين أميركي إعانات البطالة في حال عدم توقيع ترامب خطة التحفيز الاقتصادي </a></h6>
                                <p>إنتعشت Amazon أسعار النفط في الجلسة الأميركية وفاقت مكاسب خام نايمكس الأميركي 2.5% وذلك إثر إنخفاض حاد في مخزونات الخام الأميركي. فقد أظهرت بيانات إدارة معلومات الطاقة الأميركية أن مخزونات النفط الخام في الولايات المتحدة هبطت بشكل حاد الأسبوع الماضي مع انخفاض إنتاج المصافي فيما تراجعت مخزونات البنزين وارتفعت مخزونات</p>
                            </div>
                        </li>
                        <li>
                            <div className="newsImage">
                                <img className="img-fluid" src={newslistimg.src} />
                            </div>
                            <div className="newsText">
                                <p><a>أمريكا</a> منذ 5 دقائق</p>
                                <h6><a> بايدن: سيفقد حوالى 10 ملايين أميركي إعانات البطالة في حال عدم توقيع ترامب خطة التحفيز الاقتصادي </a></h6>
                                <p>إنتعشت Amazon أسعار النفط في الجلسة الأميركية وفاقت مكاسب خام نايمكس الأميركي 2.5% وذلك إثر إنخفاض حاد في مخزونات الخام الأميركي. فقد أظهرت بيانات إدارة معلومات الطاقة الأميركية أن مخزونات النفط الخام في الولايات المتحدة هبطت بشكل حاد الأسبوع الماضي مع انخفاض إنتاج المصافي فيما تراجعت مخزونات البنزين وارتفعت مخزونات</p>
                            </div>
                        </li>
                        <li>
                        <div className="newsImage">
                                <img className="img-fluid" src={newslistimg.src} />
                            </div>
                            <div className="newsText">
                                <p><a>أمريكا</a> منذ 5 دقائق</p>
                                <h6><a> بايدن: سيفقد حوالى 10 ملايين أميركي إعانات البطالة في حال عدم توقيع ترامب خطة التحفيز الاقتصادي </a></h6>
                                <p>إنتعشت Amazon أسعار النفط في الجلسة الأميركية وفاقت مكاسب خام نايمكس الأميركي 2.5% وذلك إثر إنخفاض حاد في مخزونات الخام الأميركي. فقد أظهرت بيانات إدارة معلومات الطاقة الأميركية أن مخزونات النفط الخام في الولايات المتحدة هبطت بشكل حاد الأسبوع الماضي مع انخفاض إنتاج المصافي فيما تراجعت مخزونات البنزين وارتفعت مخزونات</p>
                            </div>
                        </li>
                        <li>
                            <div className="newsImage">
                                <img className="img-fluid" src={newslistimg.src} />
                            </div>
                            <div className="newsText">
                                <p><a>أمريكا</a> منذ 5 دقائق</p>
                                <h6><a> بايدن: سيفقد حوالى 10 ملايين أميركي إعانات البطالة في حال عدم توقيع ترامب خطة التحفيز الاقتصادي </a></h6>
                                <p>إنتعشت Amazon أسعار النفط في الجلسة الأميركية وفاقت مكاسب خام نايمكس الأميركي 2.5% وذلك إثر إنخفاض حاد في مخزونات الخام الأميركي. فقد أظهرت بيانات إدارة معلومات الطاقة الأميركية أن مخزونات النفط الخام في الولايات المتحدة هبطت بشكل حاد الأسبوع الماضي مع انخفاض إنتاج المصافي فيما تراجعت مخزونات البنزين وارتفعت مخزونات</p>
                            </div>
                        </li>
                        <li>
                        <div className="newsImage">
                                <img className="img-fluid" src={newslistimg.src} />
                            </div>
                            <div className="newsText">
                                <p><a>أمريكا</a> منذ 5 دقائق</p>
                                <h6><a> بايدن: سيفقد حوالى 10 ملايين أميركي إعانات البطالة في حال عدم توقيع ترامب خطة التحفيز الاقتصادي </a></h6>
                                <p>إنتعشت Amazon أسعار النفط في الجلسة الأميركية وفاقت مكاسب خام نايمكس الأميركي 2.5% وذلك إثر إنخفاض حاد في مخزونات الخام الأميركي. فقد أظهرت بيانات إدارة معلومات الطاقة الأميركية أن مخزونات النفط الخام في الولايات المتحدة هبطت بشكل حاد الأسبوع الماضي مع انخفاض إنتاج المصافي فيما تراجعت مخزونات البنزين وارتفعت مخزونات</p>
                            </div>
                        </li>
                        <li>
                            <div className="newsImage">
                                <img className="img-fluid" src={newslistimg.src} />
                            </div>
                            <div className="newsText">
                                <p><a>أمريكا</a> منذ 5 دقائق</p>
                                <h6><a> بايدن: سيفقد حوالى 10 ملايين أميركي إعانات البطالة في حال عدم توقيع ترامب خطة التحفيز الاقتصادي </a></h6>
                                <p>إنتعشت Amazon أسعار النفط في الجلسة الأميركية وفاقت مكاسب خام نايمكس الأميركي 2.5% وذلك إثر إنخفاض حاد في مخزونات الخام الأميركي. فقد أظهرت بيانات إدارة معلومات الطاقة الأميركية أن مخزونات النفط الخام في الولايات المتحدة هبطت بشكل حاد الأسبوع الماضي مع انخفاض إنتاج المصافي فيما تراجعت مخزونات البنزين وارتفعت مخزونات</p>
                            </div>
                        </li>
                        <li>
                        <div className="newsImage">
                                <img className="img-fluid" src={newslistimg.src} />
                            </div>
                            <div className="newsText">
                                <p><a>أمريكا</a> منذ 5 دقائق</p>
                                <h6><a> بايدن: سيفقد حوالى 10 ملايين أميركي إعانات البطالة في حال عدم توقيع ترامب خطة التحفيز الاقتصادي </a></h6>
                                <p>إنتعشت Amazon أسعار النفط في الجلسة الأميركية وفاقت مكاسب خام نايمكس الأميركي 2.5% وذلك إثر إنخفاض حاد في مخزونات الخام الأميركي. فقد أظهرت بيانات إدارة معلومات الطاقة الأميركية أن مخزونات النفط الخام في الولايات المتحدة هبطت بشكل حاد الأسبوع الماضي مع انخفاض إنتاج المصافي فيما تراجعت مخزونات البنزين وارتفعت مخزونات</p>
                            </div>
                        </li>
                        <li>
                            <div className="newsImage">
                                <img className="img-fluid" src={newslistimg.src} />
                            </div>
                            <div className="newsText">
                                <p><a>أمريكا</a> منذ 5 دقائق</p>
                                <h6><a> بايدن: سيفقد حوالى 10 ملايين أميركي إعانات البطالة في حال عدم توقيع ترامب خطة التحفيز الاقتصادي </a></h6>
                                <p>إنتعشت Amazon أسعار النفط في الجلسة الأميركية وفاقت مكاسب خام نايمكس الأميركي 2.5% وذلك إثر إنخفاض حاد في مخزونات الخام الأميركي. فقد أظهرت بيانات إدارة معلومات الطاقة الأميركية أن مخزونات النفط الخام في الولايات المتحدة هبطت بشكل حاد الأسبوع الماضي مع انخفاض إنتاج المصافي فيما تراجعت مخزونات البنزين وارتفعت مخزونات</p>
                            </div>
                        </li>
                        <li>
                        <div className="newsImage">
                                <img className="img-fluid" src={newslistimg.src} />
                            </div>
                            <div className="newsText">
                                <p><a>أمريكا</a> منذ 5 دقائق</p>
                                <h6><a> بايدن: سيفقد حوالى 10 ملايين أميركي إعانات البطالة في حال عدم توقيع ترامب خطة التحفيز الاقتصادي </a></h6>
                                <p>إنتعشت Amazon أسعار النفط في الجلسة الأميركية وفاقت مكاسب خام نايمكس الأميركي 2.5% وذلك إثر إنخفاض حاد في مخزونات الخام الأميركي. فقد أظهرت بيانات إدارة معلومات الطاقة الأميركية أن مخزونات النفط الخام في الولايات المتحدة هبطت بشكل حاد الأسبوع الماضي مع انخفاض إنتاج المصافي فيما تراجعت مخزونات البنزين وارتفعت مخزونات</p>
                            </div>
                        </li>
                        <li>
                            <div className="newsImage">
                                <img className="img-fluid" src={newslistimg.src} />
                            </div>
                            <div className="newsText">
                                <p><a>أمريكا</a> منذ 5 دقائق</p>
                                <h6><a> بايدن: سيفقد حوالى 10 ملايين أميركي إعانات البطالة في حال عدم توقيع ترامب خطة التحفيز الاقتصادي </a></h6>
                                <p>إنتعشت Amazon أسعار النفط في الجلسة الأميركية وفاقت مكاسب خام نايمكس الأميركي 2.5% وذلك إثر إنخفاض حاد في مخزونات الخام الأميركي. فقد أظهرت بيانات إدارة معلومات الطاقة الأميركية أن مخزونات النفط الخام في الولايات المتحدة هبطت بشكل حاد الأسبوع الماضي مع انخفاض إنتاج المصافي فيما تراجعت مخزونات البنزين وارتفعت مخزونات</p>
                            </div>
                        </li>
                        <li>
                        <div className="newsImage">
                                <img className="img-fluid" src={newslistimg.src} />
                            </div>
                            <div className="newsText">
                                <p><a>أمريكا</a> منذ 5 دقائق</p>
                                <h6><a> بايدن: سيفقد حوالى 10 ملايين أميركي إعانات البطالة في حال عدم توقيع ترامب خطة التحفيز الاقتصادي </a></h6>
                                <p>إنتعشت Amazon أسعار النفط في الجلسة الأميركية وفاقت مكاسب خام نايمكس الأميركي 2.5% وذلك إثر إنخفاض حاد في مخزونات الخام الأميركي. فقد أظهرت بيانات إدارة معلومات الطاقة الأميركية أن مخزونات النفط الخام في الولايات المتحدة هبطت بشكل حاد الأسبوع الماضي مع انخفاض إنتاج المصافي فيما تراجعت مخزونات البنزين وارتفعت مخزونات</p>
                            </div>
                        </li>
                        <li>
                            <div className="newsImage">
                                <img className="img-fluid" src={newslistimg.src} />
                            </div>
                            <div className="newsText">
                                <p><a>أمريكا</a> منذ 5 دقائق</p>
                                <h6><a> بايدن: سيفقد حوالى 10 ملايين أميركي إعانات البطالة في حال عدم توقيع ترامب خطة التحفيز الاقتصادي </a></h6>
                                <p>إنتعشت Amazon أسعار النفط في الجلسة الأميركية وفاقت مكاسب خام نايمكس الأميركي 2.5% وذلك إثر إنخفاض حاد في مخزونات الخام الأميركي. فقد أظهرت بيانات إدارة معلومات الطاقة الأميركية أن مخزونات النفط الخام في الولايات المتحدة هبطت بشكل حاد الأسبوع الماضي مع انخفاض إنتاج المصافي فيما تراجعت مخزونات البنزين وارتفعت مخزونات</p>
                            </div>
                        </li>
                        <li>
                        <div className="newsImage">
                                <img className="img-fluid" src={newslistimg.src} />
                            </div>
                            <div className="newsText">
                                <p><a>أمريكا</a> منذ 5 دقائق</p>
                                <h6><a> بايدن: سيفقد حوالى 10 ملايين أميركي إعانات البطالة في حال عدم توقيع ترامب خطة التحفيز الاقتصادي </a></h6>
                                <p>إنتعشت Amazon أسعار النفط في الجلسة الأميركية وفاقت مكاسب خام نايمكس الأميركي 2.5% وذلك إثر إنخفاض حاد في مخزونات الخام الأميركي. فقد أظهرت بيانات إدارة معلومات الطاقة الأميركية أن مخزونات النفط الخام في الولايات المتحدة هبطت بشكل حاد الأسبوع الماضي مع انخفاض إنتاج المصافي فيما تراجعت مخزونات البنزين وارتفعت مخزونات</p>
                            </div>
                        </li>
                        <li>
                            <div className="newsImage">
                                <img className="img-fluid" src={newslistimg.src} />
                            </div>
                            <div className="newsText">
                                <p><a>أمريكا</a> منذ 5 دقائق</p>
                                <h6><a> بايدن: سيفقد حوالى 10 ملايين أميركي إعانات البطالة في حال عدم توقيع ترامب خطة التحفيز الاقتصادي </a></h6>
                                <p>إنتعشت Amazon أسعار النفط في الجلسة الأميركية وفاقت مكاسب خام نايمكس الأميركي 2.5% وذلك إثر إنخفاض حاد في مخزونات الخام الأميركي. فقد أظهرت بيانات إدارة معلومات الطاقة الأميركية أن مخزونات النفط الخام في الولايات المتحدة هبطت بشكل حاد الأسبوع الماضي مع انخفاض إنتاج المصافي فيما تراجعت مخزونات البنزين وارتفعت مخزونات</p>
                            </div>
                        </li>
                        <li>
                        <div className="newsImage">
                                <img className="img-fluid" src={newslistimg.src} />
                            </div>
                            <div className="newsText">
                                <p><a>أمريكا</a> منذ 5 دقائق</p>
                                <h6><a> بايدن: سيفقد حوالى 10 ملايين أميركي إعانات البطالة في حال عدم توقيع ترامب خطة التحفيز الاقتصادي </a></h6>
                                <p>إنتعشت Amazon أسعار النفط في الجلسة الأميركية وفاقت مكاسب خام نايمكس الأميركي 2.5% وذلك إثر إنخفاض حاد في مخزونات الخام الأميركي. فقد أظهرت بيانات إدارة معلومات الطاقة الأميركية أن مخزونات النفط الخام في الولايات المتحدة هبطت بشكل حاد الأسبوع الماضي مع انخفاض إنتاج المصافي فيما تراجعت مخزونات البنزين وارتفعت مخزونات</p>
                            </div>
                        </li>
                        <li>
                            <div className="newsImage">
                                <img className="img-fluid" src={newslistimg.src} />
                            </div>
                            <div className="newsText">
                                <p><a>أمريكا</a> منذ 5 دقائق</p>
                                <h6><a> بايدن: سيفقد حوالى 10 ملايين أميركي إعانات البطالة في حال عدم توقيع ترامب خطة التحفيز الاقتصادي </a></h6>
                                <p>إنتعشت Amazon أسعار النفط في الجلسة الأميركية وفاقت مكاسب خام نايمكس الأميركي 2.5% وذلك إثر إنخفاض حاد في مخزونات الخام الأميركي. فقد أظهرت بيانات إدارة معلومات الطاقة الأميركية أن مخزونات النفط الخام في الولايات المتحدة هبطت بشكل حاد الأسبوع الماضي مع انخفاض إنتاج المصافي فيما تراجعت مخزونات البنزين وارتفعت مخزونات</p>
                            </div>
                        </li>
                        <li>
                        <div className="newsImage">
                                <img className="img-fluid" src={newslistimg.src} />
                            </div>
                            <div className="newsText">
                                <p><a>أمريكا</a> منذ 5 دقائق</p>
                                <h6><a> بايدن: سيفقد حوالى 10 ملايين أميركي إعانات البطالة في حال عدم توقيع ترامب خطة التحفيز الاقتصادي </a></h6>
                                <p>إنتعشت Amazon أسعار النفط في الجلسة الأميركية وفاقت مكاسب خام نايمكس الأميركي 2.5% وذلك إثر إنخفاض حاد في مخزونات الخام الأميركي. فقد أظهرت بيانات إدارة معلومات الطاقة الأميركية أن مخزونات النفط الخام في الولايات المتحدة هبطت بشكل حاد الأسبوع الماضي مع انخفاض إنتاج المصافي فيما تراجعت مخزونات البنزين وارتفعت مخزونات</p>
                            </div>
                        </li>
                        <li>
                            <div className="newsImage">
                                <img className="img-fluid" src={newslistimg.src} />
                            </div>
                            <div className="newsText">
                                <p><a>أمريكا</a> منذ 5 دقائق</p>
                                <h6><a> بايدن: سيفقد حوالى 10 ملايين أميركي إعانات البطالة في حال عدم توقيع ترامب خطة التحفيز الاقتصادي </a></h6>
                                <p>إنتعشت Amazon أسعار النفط في الجلسة الأميركية وفاقت مكاسب خام نايمكس الأميركي 2.5% وذلك إثر إنخفاض حاد في مخزونات الخام الأميركي. فقد أظهرت بيانات إدارة معلومات الطاقة الأميركية أن مخزونات النفط الخام في الولايات المتحدة هبطت بشكل حاد الأسبوع الماضي مع انخفاض إنتاج المصافي فيما تراجعت مخزونات البنزين وارتفعت مخزونات</p>
                            </div>
                        </li>
                    </ul>
                </div>

                <div className="text-center mt-3 mb-3">
                    <button className="btn btn-outline-primary">المزيد</button>
                </div>

            </div>
        </>
    )
}

export default SearchResultList