import newsImage from "../../../styles/images/biden.jpg";
import twite from "../../../styles/images/twite.png";
import NewsRealtedStock from "../CategoryDetailsBoxes/CategoryDetailsBoxes";


const ArticleDetails = () => {

    return (
        <>
            <NewsRealtedStock/>

            <div className="mb-3 newsDetailimg">
                <img className="img-fluid" src={newsImage.src} />
            </div>
            <h6 className="newsDetailtext">بايدن: سيفقد حوالى 10 ملايين أميركي إعانات البطالة في حال عدم توقيع ترامب خطة التحفيز الاقتصادي </h6>
            <hr></hr>

            <div className="row">
                <div className="col-lg-1"></div>
                    <div className="col-lg-11">
                        <div className="newsDetailPtext">
                        <p>
                      لا يتوقع شرقاوي أن ينجح مشروع القانون المقدم في الكونغرس في تصنيف الجماعة إرهابية، لكنه “سيمثل أداة ضغط على الإدارة الأميركية لتغير سياستها في التعاطي مع التنظيم”، فضلا عن كونه “خطوة في طريق حظره”.
                      </p>
                      <p>
                      وأكد شرقاوي أن “الضغوط المستمرة من جانب النواب في الكونغرس على إدارة بايدن ستجعلها تغير سياستها تجاه الإخوان، أو تجعلها محايدة”.
                      </p>
                      <p>وكان كروز انتقد الطريقة التي تتعامل بها إدارة بايدن مع تنظيم الإخوان، قائلا إن “من حق الشعب الأميركي معرفة ما إذا كانت الإدارة تحاول الضغط على حلفاء الولايات المتحدة للإفراج عن المتطرفين من الإخوان”.</p>

                        <p>وقال كروز إنه “في عهد الرئيس (الأسبق) باراك أوباما ونائب الرئيس بايدن، كانت السياسات المطبقة كارثة لحلفائنا في الشرق الأوسط، ونعمة لأعدائنا. مرة أخرى، تعمل إدارة بايدن على تعزيز جماعة الإخوان والجماعات المتطرفة الأخرى في الشرق الأوسط”</p>
                        <p>لا يتوقع شرقاوي أن ينجح مشروع القانون المقدم في الكونغرس في تصنيف الجماعة إرهابية، لكنه “سيمثل أداة ضغط على الإدارة الأميركية لتغير سياستها في التعاطي مع التنظيم”، فضلا عن كونه “خطوة في طريق حظره”. </p>

                        </div>
                    </div>
            </div>
            <div className="row">
                <div className="col-12">
                <div className="VideoNews my-3">
                <div className="NewsImage">
                    <img className="img-fluid" src="/_next/static/media/biden.602d4cc9.jpg"/>
                </div>
                <div className="PlayTime"><h5>05:21</h5>
                    <div className="btn-text"><span>شاهد الآن</span>
                        <button className="btn btn-warning VideoPlay"><i className="fa fa-play"></i></button>
                    </div>
                </div>
                <div className="NewsContent">
                    <h4>بايدن: سيفقد حوالى 10 ملايين أميركي إعانات البطالة في حال عدم توقيع ترامب خطة التحفيز الاقتصادي </h4>

                </div>
            </div>
            <h6 className="newsDetailtext">بايدن: سيفقد حوالى 10 ملايين أميركي إعانات البطالة في حال عدم توقيع ترامب خطة التحفيز الاقتصادي </h6>
            <hr></hr>
                </div>
            </div>
            <div className="row">
                <div className="col-1"></div>
                <div className="col-11">
                    <div className="companies_announced">
                    <h5>شركات أعلنت خطط للإنقسام هذا ال</h5>
                    <div className="newsDetailPtext">
                        <p>
                        لا يتوقع شرقاوي أن ينجح مشروع القانون المقدم في الكونغرس في تصنيف الجماعة إرهابية، لكنه “سيمثل أداة ضغط على الإدارة الأميركية لتغير سياستها في التعاطي مع التنظيم”، فضلا
                        <a href="javascript:void(0)">
                        عن كونه “خطوة في طريق حظره”.
                        </a>
                      </p>
                      <p>وأكد شرقاوي أن “الضغوط المستمرة من جانب النواب في الكونغرس على إدارة بايدن ستجعلها تغير سياستها تجاه الإخوان، أو تجعلها محايدة”. </p>
                      <p>وكان كروز انتقد الطريقة التي تتعامل بها إدارة بايدن مع تنظيم الإخوان، قائلا إن “من حق الشعب الأميركي معرفة ما إذا كانت الإدارة تحاول الضغط على حلفاء الولايات المتحدة للإفراج عن المتطرفين من الإخوان”. </p>
                      <img className="img-fluid" src={twite.src} />

                      <p>
                      لا يتوقع شرقاوي أن ينجح مشروع القانون المقدم في الكونغرس في تصنيف الجماعة إرهابية، لكنه “سيمثل أداة ضغط على الإدارة الأميركية لتغير سياستها في التعاطي مع التنظيم”، فضلا عن كونه “خطوة في طريق حظره”.
                      </p>
                      <p>وأكد شرقاوي أن “الضغوط المستمرة من جانب النواب في الكونغرس على إدارة بايدن ستجعلها تغير سياستها تجاه الإخوان، أو تجعلها محايدة”.</p>
                      <p>
                      وكان كروز انتقد الطريقة التي تتعامل بها إدارة بايدن مع تنظيم الإخوان، قائلا إن “من حق الشعب الأميركي معرفة ما إذا كانت الإدارة تحاول الضغط على حلفاء الولايات المتحدة للإفراج عن المتطرفين من الإخوان”.
                      </p>

                        </div>
                    </div>

                </div>
            </div>

       </>


    )
}

export default ArticleDetails