/* eslint-disable @next/next/no-html-link-for-pages */
/* eslint-disable @nrwl/nx/enforce-module-boundaries */
import { SideListProps } from "apps/frontend/types/Types"
import styles from "./sidelist.module.css";
import { FC } from "react"
import Title from "apps/frontend/components/Title";

const SideList:FC<SideListProps> = ({type, title}) =>{

    return (
        <>
        <div className={styles.sidebar}>
         
            <div className={styles.listBody}>

              {
                type === "numbered" && (
                  <>
                     <Title styles={styles.themeTitle}>
                        <h4> {title} </h4>
                     </Title>
                    <ul className={styles.sidenumberList}>
                      <li key={'12'} ><a href="/newsDetails">
                        أسعار النفط تصعد بأكثر من 1% بعد رفع السعودية
                        لأسعار الخام لآسيا بأك بايدن: سيفقد حوالى 10 ملايين
                        أميركي إعانات البطالة ثر من المتوقع
                        </a></li>
                        <li key={'343'}><a href="#">
                        النفط يصعد لأعلى مستوى في أسبوعين حيث أدى رفع حظر السفر الأميركي إلى زيادة الطلب
                        </a></li>
                        <li key={'675'}><a href="#">
                        بايدن: سيفقد حوالى 10 ملايين أميركي إعانات البطالة
                        </a></li>
                        <li key={'34543'}><a href="#">
                        النفط يصعد لأعلى مستوى في أسبوعين حيث أدى رفع حظر السفر الأميركي إلى زيادة الطلب
                        </a></li>
                        <li key={'fdw43'}><a href="#">
                        أسعار النفط تصعد بأكثر من 1% بعد رفع السعودية
                        لأسعار الخام لآسيا بأك بايدن: سيفقد حوالى 10 ملايين
                        أميركي إعانات البطالة ثر من المتوقع
                        </a></li>
                        <li key={'fd43re3f'}><a href="#">
                        النفط يصعد لأعلى مستوى في أسبوعين حيث أدى رفع حظر السفر الأميركي إلى زيادة الطلب
                        </a></li>
                        <li key={'sdf43t'}><a href="#">
                        بايدن: سيفقد حوالى 10 ملايين أميركي إعانات البطالة
                        </a></li>
                        <li key={'sdf54'}><a href="#">
                        النفط يصعد لأعلى مستوى في أسبوعين حيث أدى رفع حظر السفر الأميركي إلى زيادة الطلب
                        </a></li>
                    </ul>
                  </>
                )
              }
              {
                type === "simple" && (

                  <>
                    <div className="sideSimpleListWrap">
                      <Title styles={styles.themeTitle}>
                          <h4> {title} </h4>
                      </Title>
                    
                    <ul className={styles.sidesimpleList}>
                        <li key={'12'} ><a href="/newsDetails">
                          النفط يصعد لأعلى مستوى في أسبوعين حيث أدى رفع حظر السفر الأميركي إلى زيادة الطلب
                          </a>
                          <p><a href="#">أمريكا</a> <b>منذ 5 دقائق</b></p>
                          </li>
                          <li key={'12'} ><a href="/newsDetails">
                          النفط يصعد لأعلى مستوى في أسبوعين حيث أدى رفع حظر السفر الأميركي إلى زيادة الطلب
                          </a>
                          <p><a href="#">أمريكا</a> <b>منذ 5 دقائق</b></p>
                          </li>
                          <li key={'12'} ><a href="/newsDetails">
                          النفط يصعد لأعلى مستوى في أسبوعين حيث أدى رفع حظر السفر الأميركي إلى زيادة الطلب
                          </a>
                          <p><a href="#">أمريكا</a> <b>منذ 5 دقائق</b></p>
                          </li>
                          <li key={'12'} ><a href="/newsDetails">
                          النفط يصعد لأعلى مستوى في أسبوعين حيث أدى رفع حظر السفر الأميركي إلى زيادة الطلب
                          </a>
                          <p><a href="#">أمريكا</a> <b>منذ 5 دقائق</b></p>
                          </li>
                          <li key={'12'} ><a href="/newsDetails">
                          النفط يصعد لأعلى مستوى في أسبوعين حيث أدى رفع حظر السفر الأميركي إلى زيادة الطلب
                          </a>
                          <p><a href="#">أمريكا</a> <b>منذ 5 دقائق</b></p>
                          </li>

                          {/* <li key={'343'}><a href="#">
                          <span>قبل 30 دقيقة</span>
                          النفط يصعد لأعلى مستوى في أسبوعين حيث أدى رفع حظر السفر الأميركي إلى زيادة الطلب
                          </a></li>
                          <li key={'675'}><a href="#">
                          <span>منذ 1 ساعة</span>
                          بايدن: سيفقد حوالى 10 ملايين أميركي إعانات البطالة
                          </a></li>
                          <li key={'34543'}><a href="#">
                          <span>منذ 5 ساعات</span>
                          النفط يصعد لأعلى مستوى في أسبوعين حيث أدى رفع حظر السفر الأميركي إلى زيادة الطلب
                          </a></li>
                          <li key={'fdw43'}><a href="#">
                          <span>منذ 5 دقائق</span>
                          أسعار النفط تصعد بأكثر من 1% بعد رفع السعودية
                          لأسعار الخام لآسيا بأك بايدن: سيفقد حوالى 10 ملايين
                          أميركي إعانات البطالة ثر من المتوقع
                          </a></li>
                          <li key={'fd43re3f'}><a href="#">
                          <span>قبل 30 دقيقة</span>
                          النفط يصعد لأعلى مستوى في أسبوعين حيث أدى رفع حظر السفر الأميركي إلى زيادة الطلب
                          </a></li>
                          <li key={'sdf43t'}><a href="#">
                          <span>منذ 1 ساعة</span>
                          بايدن: سيفقد حوالى 10 ملايين أميركي إعانات البطالة
                          </a></li>
                          <li key={'sdf54'}><a href="#">
                          <span>منذ 5 ساعات</span>
                          النفط يصعد لأعلى مستوى في أسبوعين حيث أدى رفع حظر السفر الأميركي إلى زيادة الطلب
                          </a></li> */}
                      </ul></div>
                  </>
                )
              }
              {
                type === 'dotList' && (
                  <>
                      <Title styles={styles.themeTitle}>
                          <h4> {title} </h4>
                      </Title>
                      <div  className="dotListwrap">
                        <ul className={styles.sideDotList}>
                          <li key={'12'} ><a href="/newsDetails">
                            <span>منذ 5 دقائق</span>
                            أسعار النفط تصعد بأكثر من 1% بعد رفع السعودية
                            لأسعار الخام لآسيا بأك بايدن: سيفقد حوالى 10 ملايين
                            أميركي إعانات البطالة ثر من المتوقع
                            </a></li>
                            <li key={'343'}><a href="#">
                            <span>قبل 30 دقيقة</span>
                            النفط يصعد لأعلى مستوى في أسبوعين حيث أدى رفع حظر السفر الأميركي إلى زيادة الطلب
                            </a></li>
                            <li key={'675'}><a href="#">
                            <span>منذ 1 ساعة</span>
                            بايدن: سيفقد حوالى 10 ملايين أميركي إعانات البطالة
                            </a></li>
                            <li key={'34543'}><a href="#">
                            <span>منذ 5 ساعات</span>
                            النفط يصعد لأعلى مستوى في أسبوعين حيث أدى رفع حظر السفر الأميركي إلى زيادة الطلب
                            </a></li>
                            <li key={'fdw43'}><a href="#">
                            <span>منذ 5 دقائق</span>
                            أسعار النفط تصعد بأكثر من 1% بعد رفع السعودية
                            لأسعار الخام لآسيا بأك بايدن: سيفقد حوالى 10 ملايين
                            أميركي إعانات البطالة ثر من المتوقع
                            </a></li>
                            <li key={'fd43re3f'}><a href="#">
                            <span>قبل 30 دقيقة</span>
                            النفط يصعد لأعلى مستوى في أسبوعين حيث أدى رفع حظر السفر الأميركي إلى زيادة الطلب
                            </a></li>
                            <li key={'sdf43t'}><a href="#">
                            <span>منذ 1 ساعة</span>
                            بايدن: سيفقد حوالى 10 ملايين أميركي إعانات البطالة
                            </a></li>
                            <li key={'sdf54'}><a href="#">
                            <span>منذ 5 ساعات</span>
                            النفط يصعد لأعلى مستوى في أسبوعين حيث أدى رفع حظر السفر الأميركي إلى زيادة الطلب
                            </a></li>
                        </ul>
                      </div>
                  </>
                )
              }
            </div>
        </div>

        </>
    )
}

export default SideList